Day4_commented.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Day 2 - Commented History from Class</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-05-16 23:50:47 "/>
<meta name="author" content="Cari Bogulski, Jason Gullifer"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Day 2 - Commented History from Class</h1>

<p>This commented history isn't as detailed. I posted the final script
from today, and added additional comments in the script. You can find
it written here, and the .R file linked to here as well.
</p>
<p>
I plan to add more thorough documentation tomorrow.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Final Script </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Final Script </h2>
<div class="outline-text-2" id="text-1">

<p>Final Script printed here:
</p>


<pre class="example"># Read the csv, you might haver to change your file or folder name
monodata&lt;-read.csv("monolingual_naming.csv")

# Remove practice from data
monodata.noprac = monodata[monodata$Procedure.Block. != "PracBlockProc",]
# Jason's English monolingual word naming dataset

# Remove "none" levels from cognate status; remove practice level from
# Procedure.Block.; remove "none" levels from Animacy
#
# For the most part, adding this type of code needs to be done after
# you realize later that you have extra levels that won't be used
# after some form of subsetting
monodata.noprac$CognateStatus &lt;- droplevels(monodata.noprac$CognateStatus)
monodata.noprac$Procedure.Block. &lt;- droplevels(monodata.noprac$Procedure.Block.)
monodata.noprac$Animacy &lt;- droplevels(monodata.noprac$Animacy)


#Make subject a factor
monodata.noprac$Subject &lt;- as.factor(monodata.noprac$Subject)

#Fix RA errors in Accuracy
monodata.noprac$Accuracy[!(monodata.noprac$Accuracy==0 | monodata.noprac$Accuracy==1)] &lt;- 1

#Preserve the now fixed original accuracy data as numeric
monodata.noprac$originalacc = monodata.noprac$Accuracy

#Make our Accuracy column a factor
monodata.noprac$Accuracy = as.factor(monodata.noprac$Accuracy)

# Set the levels to "incorrect" and "correct"
levels(monodata.noprac$Accuracy) = c("incorrect","correct") 

# Make sure to only include correct trials.
monodata.correct &lt;- monodata.noprac[monodata.noprac$Accuracy=="correct",]

# Aggregate our data using tapply().
# Here we want to get the RT split by subject and cognate status
data.applied &lt;- tapply(monodata.correct$TargetWord.RT, #first give the data vector we want to aggregate, here RT
        list(monodata.correct$Subject, monodata.correct$CognateStatus), #then give a list of factors to split the aggregation by
        mean) #finally, give the function to apply to the split data vector
data.applied &lt;- as.data.frame(data.applied) #coerce to a data.frame because tapply returns a list
data.applied$Subject &lt;- rownames(data.applied)
colnames(data.applied)&lt;-c("Cog.RT","NCog.RT","Subject")

# Aggregate our data using tapply(). Here we further aggregate our
# data, this time asking for RTs by subject, by cognate status, by
# animacy.
# It's a bit more complicated, but everything is okay once coerced to
# a data.frame
data.applied2 &lt;- tapply(monodata.correct$TargetWord.RT, 
        list(monodata.correct$Subject,
        monodata.correct$CognateStatus,
        monodata.correct$Animacy), #not here we included an additional factor in out list()
        mean)
data.applied2 &lt;- as.data.frame(data.applied2)
data.applied2$Subject &lt;- rownames(data.applied2)
colnames(data.applied2)&lt;-c("Cog.RT","NCog.RT","Subject")


# Using ddply to do the same aggregation with subject, animacy, and
# cognate status
sumdata&lt;-ddply(monodata.correct, 
               .(Subject, CognateStatus, Animacy),summarise ,meanRT=mean(TargetWord.RT))



# We can also do something more fancy where we calculate the mean, and
# 2.5 SD above and below the mean (cut high and cutlow)

sumdata&lt;-ddply(monodata.correct, 
               .(Subject, CognateStatus, Animacy),summarise ,
               meanRT=mean(TargetWord.RT),
               cuthigh = mean(TargetWord.RT) + 2.5 * sd(TargetWord.RT),
               cutlow = mean(TargetWord.RT) - 2.5 * sd(TargetWord.RT))


# We might want to return the aggregated data back on to our original
# data set. This is especially helpful for marking individual trials
# as outliers. 

transformeddata&lt;-ddply(monodata.correct, 
                       .(Subject, CognateStatus, Animacy),transform ,
                       meanRT=mean(TargetWord.RT), 
                       cuthigh = mean(TargetWord.RT) + 2.5 * sd(TargetWord.RT),
                       cutlow = mean(TargetWord.RT) - 2.5 * sd(TargetWord.RT))

transformeddata$Accuracy4Outliers &lt;- transformeddata$Accuracy

# Here we add a level to Accuracy, rel_outlier
levels(transformeddata$Accuracy) &lt;- c("incorrect", "correct", "rel_outlier")

# Now we can compare each RT to each cuthigh and cutlow, to determine whether the trial was an outlier

transformeddata$Accuracy[transformeddata$TargetWord.RT &gt; transformeddata$cuthigh | #if RT is greater than cuthigh
        transformeddata$TargetWord.RT &lt; transformeddata$cutlow] = "rel_outlier"    # or RT is lower than cutlow, assign "rel_outlier"
</pre>




<p>
<a href="./Script Files/monodata_script-5-16.R">Link to R script file</a>
</p></div>
</div>
<div id="postamble">
<p class="author"> Author: Cari Bogulski, Jason Gullifer
<a href="mailto:cari.bogulski@gmail.com">&lt;cari.bogulski@gmail.com&gt;</a>
<a href="mailto:jason.gullifer@gmail.com">&lt;jason.gullifer@gmail.com&gt;</a>
</p>
<p class="date"> Date: 2013-05-16 23:50:47 </p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
